GFTheShy/DriverSet/si/demo.si4project/Backup/stm32f4xx_it(7635).c
/**
  ******************************************************************************
  * @file    GPIO/GPIO_IOToggle/stm32f4xx_it.c 
  * @author  MCD Application Team
  * @version V1.4.0
  * @date    04-August-2014
  * @brief   Main Interrupt Service Routines.
  *          This file provides template for all exceptions handler and 
  *          peripherals interrupt service routine.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_it.h"

/** @addtogroup STM32F4xx_StdPeriph_Examples
  * @{
  */

/** @addtogroup GPIO_IOToggle
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/******************************************************************************/
/*            Cortex-M4 Processor Exceptions Handlers                         */
/******************************************************************************/

/**
  * @brief   This function handles NMI exception.
  * @param  None
  * @retval None
  */
void NMI_Handler(void)
{
}

/**
  * @brief  This function handles Hard Fault exception.
  * @param  None
  * @retval None
  */
void HardFault_Handler(void)
{
  /* Go to infinite loop when Hard Fault exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles Memory Manage exception.
  * @param  None
  * @retval None
  */
void MemManage_Handler(void)
{
  /* Go to infinite loop when Memory Manage exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles Bus Fault exception.
  * @param  None
  * @retval None
  */
void BusFault_Handler(void)
{
  /* Go to infinite loop when Bus Fault exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles Usage Fault exception.
  * @param  None
  * @retval None
  */
void UsageFault_Handler(void)
{
  /* Go to infinite loop when Usage Fault exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles SVCall exception.
  * @param  None
  * @retval None
  */
void SVC_Handler(void)
{
}

/**
  * @brief  This function handles Debug Monitor exception.
  * @param  None
  * @retval None
  */
void DebugMon_Handler(void)
{
}

/**
  * @brief  This function handles PendSVC exception.
  * @param  None
  * @retval None
  */
void PendSV_Handler(void)
{
}

/**
  * @brief  This function handles SysTick Handler.
  * @param  None
  * @retval None
  */
void SysTick_Handler(void)
{
}


/******************************************************************************/
/*                 STM32F4xx Peripherals Interrupt Handlers                   */
/*  Add here the Interrupt Handler for the used peripheral(s) (PPP), for the  */
/*  available peripheral interrupt handler's name please refer to the startup */
/*  file (startup_stm32f40xx.s/startup_stm32f427x.s/startup_stm32f429x.s).    */
/******************************************************************************/

/**
  * @brief  This function handles PPP interrupt request.
  * @param  None
  * @retval None
  */
/*void PPP_IRQHandler(void)
{
}*/
#include "drv_key.h"
#include "drv_systick.h"
#include "drv_led.h"
#include "timer.h"
u8 times1=0;
u8 times2=0;
u8 times3=0;
u8 times4=0;

void EXTI4_IRQHandler(void)
{
	drv_systick_delay_ms(30);//消抖
	if(EXTI_GetITStatus(EXTI_Line4))//判断外部中断线
	{
		EXTI_ClearITPendingBit(EXTI_Line4);
		if(GPIO_ReadInputDataBit(GPIOE, GPIO_Pin_4) == RESET)//消抖
		{
			
			times1++;
			//GPIO_ToggleBits(GPIOE,GPIO_Pin_8);
			//drv_systick_delay_ms(30);
		}
	}

	//EXTI_ClearITPendingBit(EXTI_Line4);//清除line4上的中断标志位
}
#include "oled.h"
u8 LED1;
u8 LED2;
u8 BEE;
u8 currentpage=0;

void EXTI9_5_IRQHandler(void)
{
	drv_systick_delay_ms(30);
	if(EXTI_GetITStatus(EXTI_Line5))//判断外部中断线
	{
		EXTI_ClearITPendingBit(EXTI_Line5);
		if(GPIO_ReadInputDataBit(GPIOE, GPIO_Pin_5) == RESET)//消抖
		{
			
			times2++;
			//GPIO_ToggleBits(GPIOE,GPIO_Pin_9);
			//drv_systick_delay_ms(30);
		}
	}

	if(EXTI_GetITStatus(EXTI_Line6))
	{
		EXTI_ClearITPendingBit(EXTI_Line6);
		//OLED_ShowString(3, 3, "SSSSSSS");
		//GPIO_ToggleBits(GPIOE, GPIO_Pin_10);
		if(GPIO_ReadInputDataBit(GPIOE, GPIO_Pin_6) == RESET)//消抖
		{
			
			times3++;
			//GPIO_ToggleBits(GPIOE,GPIO_Pin_9);
			//drv_systick_delay_ms(30);
		}
		
	}
}


void TIM6_DAC_IRQHandler(void)//中断函数名要和NVIC通道对应起来，一个字都不能改！
{
	if(TIM_GetITStatus(TIM6,TIM_IT_Update)){
		if(times1==1)
		{
			TIM_ClearITPendingBit(TIM6,TIM_IT_Update);
			//if(times==1)GPIO_ToggleBits(GPIOE,GPIO_Pin_9);
			GPIO_ToggleBits(GPIOE,GPIO_Pin_8);
			times1=0;
		}
		if(times1==2)
		{
			TIM_ClearITPendingBit(TIM6,TIM_IT_Update);
			//if(times==1)GPIO_ToggleBits(GPIOE,GPIO_Pin_9);
			GPIO_ToggleBits(GPIOE,GPIO_Pin_9);
			times1=0;
		}
		if(times2==1)
		{
			TIM_ClearITPendingBit(TIM6,TIM_IT_Update);
			//if(times==1)GPIO_ToggleBits(GPIOE,GPIO_Pin_9);
			GPIO_ToggleBits(GPIOB,GPIO_Pin_10);
			times2=0;
		}
		else 
		{
			times1=0;
			times2=0;
			times3=0;
		}
	}
	
}



/**
  * @}
  */ 

/**
  * @}
  */ 


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
